# St7GetEnvelopeAveragingOrder

Returns the averaging option for envelopes.

long St7GetEnvelopeAveragingOrder(long uID, long* Order)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Order

Order of averaging; either aoAverageThenEnvelope or aoEnvelopeThenAverage.